app/controllers/apps_controller.rb

  def show
    @app = App.find(params[:id])
---
SELECT * FROM "apps" WHERE ("apps".owner_id = 1)

  def create
    if signed_in?
      params[:app][:owner_id] = current_user.id
    end
    @app = App.new(params[:app])

    respond_to do |format|
      if @app.save
---
INSERT INTO "apps" ("name", "uri", "created_at", "updated_at", "session_id", "owner_id", "identifier") VALUES(NULL, NULL, '2009-10-15 04:39:08', '2009-10-15 04:39:08', NULL, NULL, 3890131435)

  def update
    @app = App.find(params[:id])
    require_owner(@app, current_user)

    respond_to do |format|
      if @app.update_attributes(params[:app])
---
SELECT * FROM "apps" WHERE ("apps"."id" = 8)
UPDATE "apps" SET "updated_at" = '2009-10-15 04:18:54', "name" = 'eriks_hello_world' WHERE "id" = 8

  def destroy
    @app = App.find(params[:id])
    require_owner(@app, current_user)

    @app.destroy
---
SELECT * FROM "apps" WHERE ("apps"."id" = 16)
DELETE FROM "apps" WHERE "id" = 16