app/controllers/files_controller.rb

  def update
    app = App.find_by_id(params[:app_id])
---
SELECT * FROM "apps" WHERE ("apps"."id" = '19') LIMIT 1