app/controllers/users_controller.rb

INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "email") VALUES('6o4mZN7XAMnZSli2_VoR', '2009-10-15 03:47:53', '2009-10-15 03:47:53', '072b466c9f0e30214687bfb3cf138f67cfc0912260bf9f2334baf2fa6994cacded066c096c32e559392d999ccf9d7e14f2390ab984048553f047d833194e3050', 'E0CnnP8izmc0RwJA4diO', '2009-10-15 03:47:53', 0, '127.0.0.1', 'mccARudXPAQlhBacNtrJ', '2009-10-15 03:47:53', 'c7b523f9f0754a42b1239428dfef88c088eda46d511a1ecf2323f398f5af36cfce7b6dc2c8c14ffb2e0f9833467445876db5a3f0835e92932e09714a47a280af', 1, NULL, 'erik', NULL, 'erik@snowedin.net')
UPDATE "users" SET "updated_at" = '2009-10-15 03:48:29', "perishable_token" = 'vC6dQMDXuwDptAO_hA7B', "last_request_at" = '2009-10-15 03:48:29' WHERE "id" = 1
---
  def create
    @user = User.new(params[:user])
    @app = App.find_by_id(session[:orphan_app_id])
    @app.name = params['app']['name']
    @app.should_validate_name = true
    @user.valid?
    if @app.valid? and @user.valid?
      @user.save
      @app.owner = @user
      @app.save